In [10]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt


df = pd.read_csv('practiceday15.csv') 
df

   EmployeeID EmployeeName    Age  Salary  Price  Marks1  Marks2  Marks3
0        E101        Alice     25   50000   1200      85      90    88.0
1        E102          Bob     30   60000   1500      78      82    80.0
2        E103      Charlie     22   52000   1100      92      95    90.0
3        E101        Alice     25   50000   1200      85      90    88.0
4        E104        David     45   80000   2500      88      85    89.0
5        E105          Eve     29   58000   1300      76      79    81.0
6        E106        Frank  75000    2200     90      91      92     NaN
7        E107        Grace     34    1900     81      83      80     NaN
8        E108        Heidi     38    1800     84      86      88     NaN
9        E109         Ivan     26   53000   1400      95      92    94.0
10       E102          Bob     30   60000   1500      78      82    80.0

In [3]:
df['discount_price'] = df['Price'] * 0.10
df

,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,discount_price
0,E101,Alice,25.0,50000.0,1200,85,90.00,88.0,120.0
1,E102,Bob,30.0,NaN,60000,1500,78.00,82.8,6000.0
2,E103,Charlie,22.0,52000.0,1100,92,95.00,90.0,110.0
3,E101,Alice,25.0,50000.0,1200,85,90.00,88.0,120.0
4,E104,David,45.0,80000.0,2500,88,85.00,89.0,250.0
5,E105,Eve,29.0,58000.0,1300,76,79.00,81.0,130.0
6,E106,Frank,NaN,75000.0,2200,90,91.92,NaN,220.0
7,E107,Grace,34.0,NaN,1900,81,83.80,NaN,190.0
8,E108,Heidi,38.0,NaN,1800,84,86.88,NaN,180.0
9,E109,Ivan,26.0,53000.0,1400,95,92.00,94.0,140.0
10,E102,Bob,30.0,NaN,60000,1500,78.00,82.8,6000.0

In [6]:
df.to_csv('discounted_products.csv', index=False)

In [7]:
duplicate_count = df['EmployeeID'].duplicated().sum()
print('Total duplicate',duplicate_count)

Total duplicate 2

In [9]:
remove_duplicate = df.drop_duplicates(subset = 'EmployeeID', keep='first')
remove_duplicate

,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,discount_price
0,E101,Alice,25.0,50000.0,1200,85,90.00,88.0,120.0
1,E102,Bob,30.0,NaN,60000,1500,78.00,82.8,6000.0
2,E103,Charlie,22.0,52000.0,1100,92,95.00,90.0,110.0
4,E104,David,45.0,80000.0,2500,88,85.00,89.0,250.0
5,E105,Eve,29.0,58000.0,1300,76,79.00,81.0,130.0
6,E106,Frank,NaN,75000.0,2200,90,91.92,NaN,220.0
7,E107,Grace,34.0,NaN,1900,81,83.80,NaN,190.0
8,E108,Heidi,38.0,NaN,1800,84,86.88,NaN,180.0
9,E109,Ivan,26.0,53000.0,1400,95,92.00,94.0,140.0

In [10]:
miss_age = df['Age'].isnull().sum() 
missing_salary = df['Salary'].isnull().sum() 

print('missing age', miss_age)
print('Missing salary', missing_salary)

missing age 1
Missing salary 4

In [11]:
mean_age = df['Age'].mean()
df['Age'] = df['Age'].fillna(mean_age)
df

,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,discount_price
0,E101,Alice,25.0,50000.0,1200,85,90.00,88.0,120.0
1,E102,Bob,30.0,NaN,60000,1500,78.00,82.8,6000.0
2,E103,Charlie,22.0,52000.0,1100,92,95.00,90.0,110.0
3,E101,Alice,25.0,50000.0,1200,85,90.00,88.0,120.0
4,E104,David,45.0,80000.0,2500,88,85.00,89.0,250.0
5,E105,Eve,29.0,58000.0,1300,76,79.00,81.0,130.0
6,E106,Frank,30.4,75000.0,2200,90,91.92,NaN,220.0
7,E107,Grace,34.0,NaN,1900,81,83.80,NaN,190.0
8,E108,Heidi,38.0,NaN,1800,84,86.88,NaN,180.0
9,E109,Ivan,26.0,53000.0,1400,95,92.00,94.0,140.0
10,E102,Bob,30.0,NaN,60000,1500,78.00,82.8,6000.0

In [12]:
df = df.dropna(subset= ['Salary'])
df

,EmployeeID,EmployeeName,Age,Salary,Price,Marks1,Marks2,Marks3,discount_price
0,E101,Alice,25.0,50000.0,1200,85,90.00,88.0,120.0
2,E103,Charlie,22.0,52000.0,1100,92,95.00,90.0,110.0
3,E101,Alice,25.0,50000.0,1200,85,90.00,88.0,120.0
4,E104,David,45.0,80000.0,2500,88,85.00,89.0,250.0
5,E105,Eve,29.0,58000.0,1300,76,79.00,81.0,130.0
6,E106,Frank,30.4,75000.0,2200,90,91.92,NaN,220.0
9,E109,Ivan,26.0,53000.0,1400,95,92.00,94.0,140.0

In [13]:
print("Mean of Marks1:", df['Marks1'].mean())
print("Mean of Marks2:", df['Marks2'].mean())
print("Mean of Marks3:", df['Marks3'].mean())

print("Max of Marks1:", df['Marks1'].max())
print("Max of Marks2:", df['Marks2'].max())
print("Max of Marks3:", df['Marks3'].max())

Mean of Marks1: 87.28571428571429
Mean of Marks2: 88.98857142857142
Mean of Marks3: 88.33333333333333
Max of Marks1: 95
Max of Marks2: 95.0
Max of Marks3: 94.0

In [15]:
df = df.copy()
df['Total_Marks'] = df['Marks1'] + df['Marks2'] + df['Marks3']

print(df[['EmployeeID','EmployeeName','Total_Marks']])

  EmployeeID EmployeeName  Total_Marks
0       E101        Alice        263.0
2       E103      Charlie        277.0
3       E101        Alice        263.0
4       E104        David        262.0
5       E105          Eve        236.0
6       E106        Frank          NaN
9       E109         Ivan        281.0

In [16]:
std_total = df['Total_Marks'].std()
print("Standard Deviation of Total Marks:", std_total)

Standard Deviation of Total Marks: 15.794513815457146

In [17]:
plt.hist(df['Age'])
plt.xlabel('Age')
plt.ylabel('Frequency')
plt.title('Histogram of Employee Age')
plt.show()

NameError: name 'plt' is not defined